academX_backend/app/controllers/schedules_controller.rb

  def index
    @schedules = Schedule.all
---
SELECT "schedules".* FROM "schedules"